<template>
  <div>
    <van-address-edit
      :area-list="areaList"
      show-delete
      show-search-result
      :search-result="searchResult"
      @save="onSave"
      @delete="onDelete"
      @change-detail="onChangeDetail"
    />
  </div>
</template>
<script>
export default {
  data() {
    return {
      // 地区列表
      areaList: {
        province_list: {
          350000: "福建省"
        },
        city_list: {
          350100: "福州市",
          350200: "厦门市",
          350300: "莆田市",
          350400: "三明市",
          350500: "泉州市",
          350600: "漳州市",
          350700: "南平市",
          350800: "龙岩市",
          350900: "宁德市"
        },
        county_list: {
          350102: "鼓楼区",
          350103: "台江区",
          350104: "仓山区",
          350105: "马尾区",
          350111: "晋安区",
          350112: "长乐区",
          350121: "闽侯县",
          350122: "连江县",
          350123: "罗源县",
          350124: "闽清县",
          350125: "永泰县",
          350128: "平潭县",
          350181: "福清市",
          350203: "思明区",
          350205: "海沧区",
          350206: "湖里区",
          350211: "集美区",
          350212: "同安区",
          350213: "翔安区",
          350302: "城厢区",
          350303: "涵江区",
          350304: "荔城区",
          350305: "秀屿区",
          350322: "仙游县",
          350402: "梅列区",
          350403: "三元区",
          350421: "明溪县",
          350423: "清流县",
          350424: "宁化县",
          350425: "大田县",
          350426: "尤溪县",
          350427: "沙县",
          350428: "将乐县",
          350429: "泰宁县",
          350430: "建宁县",
          350481: "永安市",
          350502: "鲤城区",
          350503: "丰泽区",
          350504: "洛江区",
          350505: "泉港区",
          350521: "惠安县",
          350524: "安溪县",
          350525: "永春县",
          350526: "德化县",
          350527: "金门县",
          350581: "石狮市",
          350582: "晋江市",
          350583: "南安市",
          350602: "芗城区",
          350603: "龙文区",
          350622: "云霄县",
          350623: "漳浦县",
          350624: "诏安县",
          350625: "长泰县",
          350626: "东山县",
          350627: "南靖县",
          350628: "平和县",
          350629: "华安县",
          350681: "龙海市",
          350702: "延平区",
          350703: "建阳区",
          350721: "顺昌县",
          350722: "浦城县",
          350723: "光泽县",
          350724: "松溪县",
          350725: "政和县",
          350781: "邵武市",
          350782: "武夷山市",
          350783: "建瓯市",
          350802: "新罗区",
          350803: "永定区",
          350821: "长汀县",
          350823: "上杭县",
          350824: "武平县",
          350825: "连城县",
          350881: "漳平市",
          350902: "蕉城区",
          350921: "霞浦县",
          350922: "古田县",
          350923: "屏南县",
          350924: "寿宁县",
          350925: "周宁县",
          350926: "柘荣县",
          350981: "福安市",
          350982: "福鼎市"
        }
      },
      // 详细地址搜索数据
      searchResult: []
    };
  },
  methods: {
    // 保存地址
    onSave(content) {
      // 向父组件-subAddress公共地址列表传递添加的地址信息
      // console.log(content);
      this.$emit("son_getAddressEdit", content);
    },
    // 删除地址
    onDelete() {
      Toast("delete");
    },
    // 修改详细地址
    onChangeDetail(val) {
      if (val) {
        this.searchResult = [
          {
            name: "仰恩大学",
            address: "福建省泉州市马甲镇仰恩大学"
          },
          {
            name: "仰恩大学",
            address: "福建省泉州市马甲镇仰恩大学旧区"
          },
          {
            name: "仰恩大学",
            address: "福建省泉州市马甲镇仰恩大学新区"
          }
        ];
      } else {
        this.searchResult = [];
      }
    }
  }
};
</script>